system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs
(
    "libgroovyBC.so"
    "libsimpleFunctionObjects.so"
    "libsimpleSwakFunctionObjects.so"
    "libswakFunctionObjects.so"
    "libgroovyStandardBCs.so"
);

application     silicaROicoFoam;

startFrom       latestTime; //latestTime;//startTime;

startTime       0;

stopAt          endTime;//endTime;

endTime         31536000;

deltaT          1e-6;

writeControl    timeStep;

writeInterval   25;

purgeWrite      0;

writeFormat     binary;

writePrecision  6;

writeCompression off;//on

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep    yes;

maxCo             5;//0.5;

initialisationTime  0.45; // time before silica and RO physics are not operating (allow fields to initialise)

foulingTimeFactor   5e6;//100000; // time scale multiple for the movement of the mesh ie foulingTimeFactor=10 then 1 simulation second is 10 seconds.

caseDimensions  3; // value (2 or 3, indicating if 2D or 3D geometry)

seedProbabilityFactor   5; // 1 in seedProbabilityFactor chance of growth in first 24 hours (initiation).

curvatureFactor     0.9; // value y component of point normal vector must be greater than for seed to already exist

seedType    2; //0=roughness, 1=crystal, 2=runtime seeding
seedXmin    0.00072;
seedXmax    0.00078;
seedZmin    0.00047;
seedZmax    0.00052;
seedY       1e-9;//1e-6;

growthThreshold     1e-20;

surfaceRoughness    1e-5;

dtSurfaceOn     1; // 0 to turn off surface large time scale, 1 to turn on
dtSurface     432000;//21600;//3600;
minVoltoArea    4e-6;
fluidFieldIterations    100;

functions
{
    #includeFunc    flowRatePatch(name=membrane)
    
    silicaDepositMass
    {
        type surfaceFieldValue;
        writeControl    writeTime;
        writeFields     false;
        regionType  patch;
        name        membrane;
        operation sum;
        fields
        (
            SiMassDepositFace_vf
        );
    }

    pressureDifferencePatch // to run comment out other functions and run: postProcess -fields "(p)" >> pressureData
    {
        patch1 inlet;
        patch2 outlet;

        #includeEtc "caseDicts/postProcessing/pressure/pressureDifferencePatch.cfg"
    }

}

//functions
//{
//    patchMassFlow
//    {
//        type patchExpression;
//        accumulations (
//            sum
//        );
//        patches (
//            inlet
//            outlet
//            membrane
//        );
//        expression "phi";
//        verbose true;
//        ignore_unimplemented_simpleFunctionObject::movePoints true;
//    }
//};

// ************************************************************************* //
