constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    arch        "LSB;label=32;scalar=64";
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    membrane
    {
        type            patch;
        nFaces          23662;
        startFace       597734;
    }
    spacer
    {
        type            patch;
        nFaces          22113;
        startFace       621396;
    }
    frontside
    {
        type            cyclicAMI;
        neighbourPatch  backside;
        transform translational;
        separationVector (0 0 -0.00806);
        nFaces          1386;
        startFace       643509;
    }
    inlet
    {
        type            patch;
        nFaces          1350;
        startFace       644895;
    }
    outlet
    {
        type            patch;
        nFaces          1353;
        startFace       646245;
    }
    top
    {
        type            patch;
        nFaces          10248;
        startFace       647598;
    }
    backside
    {
        type            cyclicAMI;
        neighbourPatch  frontside;
        transform translational;
        separationVector (0 0 0.00806);
        nFaces          1370;
        startFace       657846;
    }
)

// ************************************************************************* //
