constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      dynamicMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//https://openfoamwiki.net/index.php/Parameter_Definitions_-_dynamicMotionSolverFvMesh

dynamicFvMesh   dynamicMotionSolverFvMesh;

//twoDMotion      no; //set to 'yes' when 2D case

motionSolverLibs ( "libfvMotionSolvers.so" );

/*
solver          displacementLaplacian;

displacementLaplacianCoeffs
{
    diffusivity     quadratic inverseDistance (top); //quadratic inversePointDistance (membrane);
}
*/

solver displacementSBRStress;

diffusivity quadratic inverseDistance (membrane spacer);

/*
solver displacementLaplacian;

diffusivity     inverseVolume; //quadratic inversePointDistance (membrane spacer);
                //inverseDistance
                //inverseFaceDistance
                //inversePointDistance
                //uniform
*/
//diffusivity uniform 2.0;//1.0;

//distancePatches 1 (membrane);

//frozenDiffusion yes;

//pseudoSolid
//{
//    poissonsRatio           0.5;
//    nCorrectors             3;
//    convergenceTolerance    1e-9;
//};


// ************************************************************************* //
