constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;

nu              nu [0 2 -1 0 0 0 0] 1e-6; // kinematic viscosity of water

rho             rho [1 -3 0 0 0 0 0] 1000; // density of water

//Silica chemistry additions

D_Sitot         D_Sitot [0 2 -1 0 0 0 0] 1e-9; //Rebreanu, Laura, Jean-Pierre Vanderborght, and Lei Chou. “The Diffusion Coefficient of Dissolved Silica Revisited.” Marine Chemistry 112, no. 3 (December 16, 2008): 230–33. https://doi.org/10.1016/j.marchem.2008.08.004.
D_SiO2          D_SiO2 [0 2 -1 0 0 0 0] 1e-9; //as above//https://agupubs.onlinelibrary.wiley.com/doi/full/10.1002/2013WR013794
D_Cl           D_Cl [0 2 -1 0 0 0 0] 1.68e-9; //2.03e-9; //https://www.ukessays.com/essays/biology/measurement-of-liquid-diffusion-coefficient-biology-essay.php
D_Na           D_Na [0 2 -1 0 0 0 0] 1.68e-9; //1.33e-9; //https://www.ukessays.com/essays/biology/measurement-of-liquid-diffusion-coefficient-biology-essay.php
D_X            D_X [0 2 -1 0 0 0 0] 1e-14; //value to make crystalline silica on surface spread outward from a seed

ka              ka [0 -3 0 0 1 0 0] 1.5848e-7; // = 10**-9.8 * 1000;
kw              kw [0 -6 0 0 2 0 0] 1e-8; //=10**-14 * 1000**2;

kf              kf [0 0 -1 0 0 0 0] 1e-6; //about the same as the rate it is generated at.

kc              kc [0 0 -1 0 0 0 0] 1e-7; //cementing rate constant

T               T [0 0 0 1 0 0 0] 298; // [K] temperature
//C_sat           C_sat [0 -3 0 0 1 0 0] 1.942;// 1000 * 10^(-0.26 - 731/T) (ksp calculated see report) [mol/m3] 

concDimensions  concDimensions [0 -3 0 0 1 0 0] 1; //give solution to C_H correct dimensions
timeDimension   timeDimension [0 0 -1 0 0 0 0] 1;
tempDimension   tempDimension [0 0 0 1 0 0 0] 1;
lengthDimension lengthDimension [1 0 0 0 0 0 0] 1;
baseWaterConc   baseWaterConc [0 -3 0 0 1 0 0] 55500; 

// ************************************************************************* //
