0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{

    inlet
    {
        type            fixedValue;
        value           uniform (0.1 0 0);
        //type              flowRateInletVelocity;
        //volumetricFlowRate  constant 6.24e-7; //0.00078*0.008*0.1 [m3/s]
        //value           uniform (0 0 0);
        //type            zeroGradient;
        //type    groovyBC;
        //valueExpression "vector(vx, 0, 0)";
        //value           uniform (0.06 0 0);
        //variables       "h=0.00078;umax=0.4;vx=umax*(1-pow(2*(pos().y-h/2)/h, 2));";
        //variables         "h=0.00078;umax=0.1;vx=(pos().y>0.0001 && pos().y<0.00068 ? 0.1 : 0);";
    }

    outlet
    {
        type            zeroGradient;
    }

    top
    {
        type            fixedValue;
        value uniform (0 0 0);
        //type            noSlip;
    }

   membrane
    {
        //type            movingWallVelocity;
        //value           uniform (0 -0.000014 0);
        //type              noSlip;
        //type            movingWallVelocity;
        //value           uniform (0 -0.000014 0);

        type            groovyBC;
        //valueExpression "vector(0, -p/10000000, 0)";
        valueExpression "vector(0, vy, 0)";
        value           uniform (0 0 0);
        variables       "A=(X_SiO2_M_vf<0.05 ? 1 : X_SiO2_M_vf>0.95 ? 0 : 1-X_SiO2_M_vf);osmotic_coefficient=0.95;T=298;Lp=5.2e-11;Ptm=(p+1700000);C_salt=(C_Na + C_Cl + C_Sitot + C_SiO2);vtm=Lp*(Ptm-osmotic_coefficient*C_salt*8.314*T)*A;vy=-vtm;";//vy=(time()<0.1 ? -vtm*time()/0.1 : -vtm);
    }

    bottom
    {
        //type            movingWallVelocity;
        //value uniform (0 0 0);
        type            fixedValue;
        value uniform (0 0 0);
        //type            noSlip;
    }

    frontside
    {
        //type            slip;
        //type            fixedValue;
        //value uniform (0 0 0);
        type            cyclicAMI;
    }

    backside
    {
        type            cyclicAMI;
        //type            slip;
        //type            fixedValue;
        //value uniform (0 0 0);
    }

    spacer
    {
        //type            noSlip;
        type            fixedValue;
        value uniform (0 0 0);
    }

    //frontAndBackPlanes
    //{
    //    type            empty;
    //}
}

// ************************************************************************* //
