0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

//initP           400000;
//finalP          1700000;
finalP          0;

internalField   uniform $finalP;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }

    outlet
    {
        type            fixedValue;
        value           uniform $finalP;
        //type            totalPressure;
        //rho             none;
        //p0              uniform $finalP;
        //value           uniform $finalP;
        //type            groovyBC;
        //valueExpression  "time()<0.1 ? ($finalP - $initP)*time()/0.1 + $initP : $finalP";
        //value           uniform $finalP;
    }

    top
    {
        type            zeroGradient;
    }

   membrane
    {
        type            zeroGradient;
    }

    bottom
    {
        type        zeroGradient;
    }

    frontside
    {
        type cyclicAMI;//zeroGradient;
    }

    backside
    {
        type cyclicAMI;//zeroGradient;
    }

    spacer
    {
        type zeroGradient;
    }


    //frontAndBackPlanes
    //{
    //    type            empty;
    //}
}

// ************************************************************************* //
