0/C_Cl
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      C_Cl;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -3 0 0 1 0 0];

initConc        99.85;//99.95;
internalField   uniform $initConc;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform $initConc;
    }

    outlet
    {
        type            zeroGradient;
    }

    top
    {
        type            zeroGradient;
    }

   membrane
    {
        //type            fixedGradient;
        //gradient        uniform -7;
        //type            fixedValue;
        //value           uniform 96;
        //type            groovyBC;
        //valueExpression "time()<0.1 ? $initConc : Cwall"; //"Cwall>C ? Cwall : C"; //"C*D/(D-vw*deltay)";
        //value           $internalField;
        //variables       "C=internalField(C_Cl);vw=mag(U&normal());D=D_Cl;deltay=mag(delta());Cwall=C*(vw*deltay/D + 1);";
        type        zeroGradient;
    }

    bottom
    {
        type        zeroGradient;
    }

    frontside
    {
        type cyclicAMI;//zeroGradient;
    }

    backside
    {
        type cyclicAMI;//zeroGradient;
    }

    spacer
    {
        type zeroGradient;
    }


    //frontAndBackPlanes
    //{
    //    type            empty;
    //}
}

// ************************************************************************* //
