0/C_H
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      C_H;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -3 0 0 1 0 0];

internalField   uniform 10e-5;//3.98e-7;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 10e-5;//3.98e-7;
    }

    outlet
    {
        type            zeroGradient;
    }

    top
    {
        type            zeroGradient;
    }

   membrane
    {
        type            zeroGradient;
    }

    bottom
    {
        type        zeroGradient;
    }
    
    frontside
    {
        type cyclicAMI;//zeroGradient;
    }

    backside
    {
        type cyclicAMI;//zeroGradient;
    }

    spacer
    {
        type zeroGradient;
    }
}

// ************************************************************************* //
