0/C_Na
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    arch        "LSB;label=32;scalar=64";
    location    "0";
    object      C_Na;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -3 0 0 1 0 0];

initConc 100;
internalField   uniform $initConc;

boundaryField
{
    spacer
    {
        type            zeroGradient;
    }
    membrane
    {
        type            zeroGradient;
        //type            groovyBC;
        //valueExpression "time()<0.1 ? $initConc : Cwall"; //"C*D/(D-vw*deltay)";
        //value           $internalField;
        //variables       "C=internalField(C_Na);vw=mag(U&normal());D=D_Na;deltay=mag(delta());Cwall=C*(vw*deltay/D + 1);";
    }
    frontside
    {
        type            cyclicAMI;//zeroGradient;
    }
    outlet
    {
        type            zeroGradient;
    }
    backside
    {
        type            cyclicAMI;//zeroGradient;
    }
    inlet
    {
        type            fixedValue;
        value           uniform $initConc;
    }
    top
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //