0/SiMassDepositFace
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       areaScalarField;
    object      SiMassDepositFace;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 0 0 0 0 0 0];

initConc        0;
internalField   uniform $initConc;

//referenceLevel  0;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    frontside
    {
        type            fixedValue;
        value           uniform 0;
    }
    backside
    {
        type            fixedValue;
        value           uniform 0;
    }
    spacer
    {
        type            fixedValue;
        value           uniform 0;
    }
}

// ************************************************************************* //
