system/faSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      faSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default            Euler;
}

gradSchemes
{
    default             Gauss linear;
    //grad(p)             Gauss linear;
}

divSchemes
{
    default             none;
    //div(phis,Cs)        Gauss linear;
}

laplacianSchemes
{
    default             none;
    laplacian(D_X,X_SiO2_M)    Gauss linear corrected;
    laplacian(D_x,X_SiO2_M)    Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default             corrected;
}


// ************************************************************************* //