system/faSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      faSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    X_SiO2_M
    {
        solver          PBiCGStab;//PBiCG;
        preconditioner  DIC;
        minIter         0;
        maxIter         2000;
        tolerance       1e-06;
        relTol          0;
    }

    dispValue
    {
        solver          PBiCGStab;//PBiCG;
        preconditioner  DIC;
        minIter         0;
        maxIter         2000;
        tolerance       1e-06;
        relTol          0;
    }

    SiMassDepositFace
    {
        solver          PBiCGStab;//PBiCG;
        preconditioner  DIC;
        minIter         0;
        maxIter         2000;
        tolerance       1e-06;
        relTol          0;
    }
}

PISO
{
    nCorrectors                2;
    nNonOrthogonalCorrectors   0;
}

SIMPLE
{
    nTimeCorrectors             6;
    nNonOrthogonalCorrectors    1;
}

relaxationFactors
{
    p               0.7;
    U               0.7;
    k               0.7;
    epsilon         0.7;
    R               0.7;
}


// ************************************************************************* //